avrxml/asf/thirdparty/wireless/avr2025_mac/apps/mac/no_beacon/dev/main.c
#endif  /* (MAC_START_REQUEST_CONFIRM == 1) */

/*
 * Callback function usr_mlme_sync_loss_ind
 *
 * @param LossReason     Reason for synchronization loss.
 * @param PANId          The PAN identifier with which the device lost
 *                       synchronization or to which it was realigned.
 * @param LogicalChannel The logical channel on which the device lost
 *                       synchronization or to which it was realigned.
 * @param ChannelPage    The channel page on which the device lost
 *                       synchronization or to which it was realigned.
 */
void usr_mlme_sync_loss_ind(uint8_t LossReason,
		uint16_t PANId,
		uint8_t LogicalChannel,
		uint8_t ChannelPage)
{
	/*
	 * Once we lost sync this the coordinator we need to re-sync.
	 * Since we the network parameter are not supposed ot change,
	 * use the already known parameters form our coordinator.
	 */
#ifdef BEACON_SUPPORT
	wpan_mlme_sync_req(LogicalChannel,
			ChannelPage,
			1);
#endif /* BEACON_SUPPORT */

	/* Keep compiler happy. */
	LossReason = LossReason;
	PANId = PANId;
}

/* Alert to indicate something has gone wrong in the application */
static void app_alert(void)
{
	while (1) {
		#if LED_COUNT > 0
		LED_Toggle(LED0);
		#endif

		#if LED_COUNT > 1
		LED_Toggle(LED1);
		#endif

		#if LED_COUNT > 2
		LED_Toggle(LED2);
		#endif

		#if LED_COUNT > 3
		LED_Toggle(LED3);
		#endif

		#if LED_COUNT > 4
		LED_Toggle(LED4);
		#endif

		#if LED_COUNT > 5
		LED_Toggle(LED5);
		#endif

		#if LED_COUNT > 6
		LED_Toggle(LED6);
		#endif

		#if LED_COUNT > 7
		LED_Toggle(LED7);
		#endif
		delay_us(0xFFFF);
	}
}

#ifndef BEACON_SUPPORT

/*
 * @brief Callback function for the application timer
 *        initiating polling of coordinator
 *
 * @param parameter Pointer to callback parameter
 *                  (not used in this application, but could be if desired).
 */
static void app_initiate_polling(void *parameter)
{
	/*
	 * Initiate MLME-POLL.request service and have it placed in the MLME-SAP
	 * queue.
	 *
	 * @param CoordAddrSpec   Pointer to wpan_addr_spec_t structure for the
	 * coordinator.
	 *
	 * @return true - success; false - buffer not availability or queue
	 * full.
	 */
	wpan_addr_spec_t coord_addr_spec;

	coord_addr_spec.AddrMode = WPAN_ADDRMODE_SHORT;
	coord_addr_spec.PANId = DEFAULT_PAN_ID;
	coord_addr_spec.Addr.short_address = coord_addr;
#ifdef SIO_HUB
	printf("Poll coordinator\r\n");
#endif
	wpan_mlme_poll_req(&coord_addr_spec);
	/*Keep compiler happy*/
	parameter = parameter;
}

#endif /* BEACON_SUPPORT */

/*
 * @brief Callback function indicating network search
 *
 * @param parameter Pointer to callback parameter
 *                  (not used in this application, but could be if desired).
 */
static void network_search_indication_cb(void *parameter)
{
	LED_Toggle(LED_NWK_SETUP);

	/* Re-start timer again. */

	/*sw_timer_start(APP_TIMER,
	 *              500000,
	 *              SW_TIMEOUT_RELATIVE,
	 *              (FUNC_PTR)network_search_indication_cb,
	 *              NULL);*/

#ifndef BEACON_SUPPORT
	/* Re-start led timer again. */
	sw_timer_start(APP_TIMER,
			LED_ON_DURATION,
			SW_TIMEOUT_RELATIVE,
			(FUNC_PTR)network_search_indication_cb,
			NULL);
#endif /* BEACON_SUPPORT */
	parameter = parameter; /* Keep compiler happy. */
}

/*
 * @brief Callback function for switching off the LED after data reception
 *
 * @param parameter Pointer to callback parameter
 *                  (not used in this application, but could be if desired).
 */
static void rx_data_led_off_cb(void *parameter)
{
	LED_Off(LED_DATA);

	parameter = parameter; /* Keep compiler happy. */
}

#ifndef BEACON_SUPPORT

/*
 * @brief function for the sending received data back to coordinator
 *
 * @param data Pointer to received data
 *
 */
static void send_data(uint8_t *data)
{
	/*
	 * Send some data and restart timer.
	 * Use: bool wpan_mcps_data_req(uint8_t SrcAddrMode,
	 *                              wpan_addr_spec_t *DstAddrSpec,
	 *                              uint8_t msduLength,
	 *                              uint8_t *msdu,
	 *                              uint8_t msduHandle,
	 *                              uint8_t TxOptions);
	 *
	 * This request will cause a mcps data confirm message ->
	 * usr_mcps_data_conf
	 */

	uint8_t src_addr_mode;
	wpan_addr_spec_t dst_addr;
	static uint8_t msduHandle = 0;

	src_addr_mode = WPAN_ADDRMODE_SHORT;

	dst_addr.AddrMode = WPAN_ADDRMODE_SHORT;
	dst_addr.PANId = DEFAULT_PAN_ID;
	ADDR_COPY_DST_SRC_16(dst_addr.Addr.short_address, coord_addr);

	msduHandle++;
#ifdef MAC_SECURITY_ZIP
	wpan_mcps_data_req(src_addr_mode,
			&dst_addr,
			1,                                  /* msduLength */
			data,
			msduHandle,
			WPAN_TXOPT_ACK,
			ZIP_SEC_MIN,                                     /*
	                                                                  *
	                                                                  *
	                                                                  *
	                                                                  *SecurityLevel
	                                                                  **/
			NULL,
			ZIP_KEY_ID_MODE,                                 /*
	                                                                  *
	                                                                  *
	                                                                  *
	                                                                  *KeyIdMode
	                                                                  **/
			deviceShortAddress);                                  /*
	                                                                       *
	                                                                       *
	                                                                       *
	                                                                       *KeyIndex
	                                                                       **/
#else
	wpan_mcps_data_req(src_addr_mode,
			&dst_addr,
			1,
			data,
			msduHandle,
			WPAN_TXOPT_ACK);
#endif /* MAC_SECURITY_ZIP */
}

#endif /* BEACON_SUPPORT */
#if (defined ENABLE_SLEEP || defined RTC_SLEEP)
static void enter_sleep(uint32_t timeout)
{
	/*Entering Power save after configuring Timer running at 4MHz as Wakeup
	 * source*/
	sys_sleep = true;
	#ifdef ENABLE_SLEEP
	ENTER_CRITICAL_REGION();

	/* Stop the Software timer running at CPU clock and initialize the
	 * software timer to run at 4MHz clock*/
	common_tc_stop();
	common_tc_init();
	set_common_tc_overflow_callback(hw_overflow_cb);
	set_common_tc_expiry_callback(hw_expiry_cb);
	timeout = timeout - MCU_WAKEUP_TIME;
	/*Start Wakeup timer*/
	sw_timer_start(APP_TIMER_SLEEP, timeout,
			SW_TIMEOUT_RELATIVE,
			(FUNC_PTR)wakeup_cb,
			NULL);
	LEAVE_CRITICAL_REGION();
	/* put the MCU in idle mode with timer as wakeup source*/
	system_set_sleepmode(SYSTEM_SLEEPMODE_IDLE_2);
	system_sleep();
    #endif
    #ifdef RTC_SLEEP
	/*Configure the rtc module and callback*/
	configure_rtc_count();
	/* Configure and enable callback */
	configure_rtc_callbacks();
	/* Set timeout period for rtc*/
	res = timeout % 1000;
	timeout = timeout / 1000;
	rtc_count_set_period(timeout);
	/*put the MCU in standby mode with RTC as wakeup source*/
	system_set_sleepmode(SYSTEM_SLEEPMODE_STANDBY);
	system_sleep();
	#endif
}

#ifdef RTC_SLEEP
void configure_rtc_count(void) /* Configuring rtc clock prescaler and mode*/
{
	struct rtc_count_config config_rtc_count;
	rtc_count_get_config_defaults(&config_rtc_count);
	config_rtc_count.prescaler           = RTC_COUNT_PRESCALER_DIV_1;
	config_rtc_count.mode                = RTC_COUNT_MODE_16BIT;

