avrxml/asf/thirdparty/wireless/avr2025_mac/apps/mac/no_beacon/dev/main.c
	/** Continuously update the counter value so no synchronization is
	 *  needed for reading. */
	config_rtc_count.continuously_update = true;
	rtc_count_init(&config_rtc_count);
	rtc_count_enable();
}

void configure_rtc_callbacks(void)
{
	/*Register rtc callback*/
	rtc_count_register_callback(
			rtc_overflow_callback, RTC_COUNT_CALLBACK_OVERFLOW);
	rtc_count_enable_callback(RTC_COUNT_CALLBACK_OVERFLOW);
}

void rtc_overflow_callback(void)
{
	/* Do something on RTC overflow here */
	rtc_count_disable();
	/* Wakeup callback to switch the timer to default cpu clock*/
	wakeup_cb(NULL);
}

#endif
void wakeup_cb(void *parameter)
{
	sys_sleep = false;
    #ifdef ENABLE_SLEEP
	ENTER_CRITICAL_REGION();

	/* Stop the Software timer running at 4MHz clock and initialize the
	 * software timer to default cpu clock*/
	common_tc_stop();
	common_tc_init();
	set_common_tc_overflow_callback(hw_overflow_cb);
	set_common_tc_expiry_callback(hw_expiry_cb);
	sw_timer_stop(APP_TIMER_SLEEP);
	LEAVE_CRITICAL_REGION();
	#endif

	/* Callback Function in MAC for beacon Synchronization and Handling the
	 * residual time after Wakeup*/
	mac_wakeup(res);
}

#endif

/*
 * @brief This function will show up the application
 *        and stack build features and available in the firmware
 * @param void
 *
 */
static void print_stack_app_build_features(void)
{
#ifdef STB_ON_SAL
	printf("\r\n Security Tool Box On SAL : Enabled");
#else
	printf("\r\n Security Tool Box On SAL : Disabled");
#endif

#ifdef MAC_SECURITY_ZIP
	printf("\r\n MAC Data & Security Module : Enabled");
#else
	printf("\r\n MAC Data & Security Module : Disabled");
#endif

#ifdef MAC_SECURITY_BEACON
	printf("\r\n MAC Beacon Security : Enabled");
#else
	printf("\r\n MAC Beacon Security : Disabled");
#endif

#ifdef HIGH_DATA_RATE_SUPPORT
	printf("\r\n High Data Rate Support : Enabled");
#else
	printf("\r\n High Data Rate Support : Disabled");
#endif

#ifdef GTS_SUPPORT
	printf("\r\n MAC GTS Support : Enabled");
#else
	printf("\r\n MAC GTS Support : Disabled");
#endif
}
